// Багш сурагчдын эцсийн шалгалтын дүнг дүгнэхээр болжээ
// 1. Бат - 67 оноо, Онц Дүмд - 59 оноо авчээ.
// 2. Шалгалтын онооноос хамааран багш тодорхой дүнгийн жагсаалт гаргах ёстой бөгөөд энэ нь
// a. Хэрвээ оноо 60 хувиас доош байвал (60 орохгүй) - Маш муу
// b. Хэрвээ оноо 60 - 70 (70 орохгүй) хооронд байвал - Хангалттай
// c. Хэрвээ оноо 70 - 80 (80 орохгүй) хооронд байвал - Дунд
// d. Хэрвээ оноо 80 - 90 (90 орохгүй) хооронд байвал - Сайн
// e. Хэрвээ оноо 90 - 100 хооронд байвал - Маш сайн гэсэн үнэлгээг өгч байгаа юм байна.
// 3. Тэгвэл тухайн сурагчдыг тэнцсэн болоод тэнцээгүй эсэхийг жагсааж доорх хэлбэрээр
// НЭР - АВСАН ОНОО - ҮНЭЛГЭЭ гэсэн маягаар console дээр харуулна уу.

let a = 67;
let ner = "Bat";
let b = 59;
let ner1 = "Onts dumd";

if(a < 60) {
    console.log(a,ner,"mash muu");
}    
if(b < 60){
    console.log(b, ner1, "mash muu");
}
if(a >= 60 && a < 70) {
    console.log(a,ner,"hangalttai");
}    
if(b >= 60 && b < 70){
    console.log(b, ner1, "hangalttai");
}

if(a >= 70 && a < 80) {
    console.log(a,ner,"dund");
}   
if(b >= 70 && b < 80){
    console.log(b, ner1, "dund");
}

if(a >= 80 && a < 90) {
    console.log(a,ner,"sain");
}   
if(b >= 80 && b < 90){
     console.log(b, ner1, "sain");
}
if(a >= 90 && a <= 100) {
    console.log(a,ner,"mash sain");
}
if(b >= 90 && b <= 100){
    console.log(b, ner1, "mash sain");
}
